app/controllers/sessions_controller.rb

SELECT  "session_tokens".* FROM "session_tokens"  WHERE "session_tokens"."user_id" = 1  ORDER BY "session_tokens"."updated_at" DESC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."user_name" = 'Louis' LIMIT 1
SELECT  1 AS one FROM "session_tokens"  WHERE "session_tokens"."user_id" = 1 AND "session_tokens"."token" = '#<SessionToken:0x007fd6d4c1ae00>' LIMIT 1
---
  def create
    user = User.find_by_credentials(session_params[:user_name],session_params[:password])
    if user
      # unless SessionToken.find_by(user_id: user.id).include?(session[:session_token])
      unless SessionToken.exists?(user_id: user.id, token: session[:session_token])