app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "password_digest", "updated_at", "user_name") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    user = User.new(user_params)
    if user.save